Import the dataset

In [1]:
dataset <- read.csv("data/Data.csv")

Now view the dataset

In [2]:
View(dataset)

   Country Age Salary Purchased
1  France  44  72000  No
2  Spain   27  48000  Yes
3  Germany 30  54000  No
4  Spain   38  61000  No
5  Germany 40     NA  Yes
6  France  35  58000  Yes
7  Spain   NA  52000  No
8  France  48  79000  Yes
9  Germany 50  83000  No
10 France  37  67000  Yes

Missing value treatment

In [3]:
dataset$Salary <- ifelse(is.na(dataset$Salary),mean(dataset$Salary,na.rm=TRUE),dataset$Salary)
View(dataset)

   Country Age Salary   Purchased
1  France  44  72000.00 No
2  Spain   27  48000.00 Yes
3  Germany 30  54000.00 No
4  Spain   38  61000.00 No
5  Germany 40  63777.78 Yes
6  France  35  58000.00 Yes
7  Spain   NA  52000.00 No
8  France  48  79000.00 Yes
9  Germany 50  83000.00 No
10 France  37  67000.00 Yes

In [4]:
dataset$Age <- ifelse(is.na(dataset$Age),mean(dataset$Age,na.rm=T),dataset$Age)
View(dataset)

   Country Age      Salary   Purchased
1  France  44.00000 72000.00 No
2  Spain   27.00000 48000.00 Yes
3  Germany 30.00000 54000.00 No
4  Spain   38.00000 61000.00 No
5  Germany 40.00000 63777.78 Yes
6  France  35.00000 58000.00 Yes
7  Spain   38.77778 52000.00 No
8  France  48.00000 79000.00 Yes
9  Germany 50.00000 83000.00 No
10 France  37.00000 67000.00 Yes

Encoding categorical data

In [5]:
dataset$Country <-factor(dataset$Country,levels = c("France","Spain","Germany"),labels = c(1,2,3))
View(dataset)

   Country Age      Salary   Purchased
1  1       44.00000 72000.00 No
2  2       27.00000 48000.00 Yes
3  3       30.00000 54000.00 No
4  2       38.00000 61000.00 No
5  3       40.00000 63777.78 Yes
6  1       35.00000 58000.00 Yes
7  2       38.77778 52000.00 No
8  1       48.00000 79000.00 Yes
9  3       50.00000 83000.00 No
10 1       37.00000 67000.00 Yes

In [6]:
dataset$Purchased <- factor(x = dataset$Purchased,levels =c("No","Yes") ,labels =c(0,1))
View(dataset)

   Country Age      Salary   Purchased
1  1       44.00000 72000.00 0
2  2       27.00000 48000.00 1
3  3       30.00000 54000.00 0
4  2       38.00000 61000.00 0
5  3       40.00000 63777.78 1
6  1       35.00000 58000.00 1
7  2       38.77778 52000.00 0
8  1       48.00000 79000.00 1
9  3       50.00000 83000.00 0
10 1       37.00000 67000.00 1

Feature Sclaing

In [7]:
dataset[,2:3] <- scale(dataset[,2:3])
View(dataset)

   Country Age        Salary     Purchased
1  1        0.7199314  0.7110128 0
2  2       -1.6236751 -1.3643758 1
3  3       -1.2100975 -0.8455287 0
4  2       -0.1072238 -0.2402070 0
5  3        0.1684946  0.0000000 1
6  1       -0.5208015 -0.4996306 1
7  2        0.0000000 -1.0184777 0
8  1        1.2713683  1.3163344 1
9  3        1.5470867  1.6622325 0
10 1       -0.2450830  0.2786401 1

Split dataset into training_set and test_set

In [11]:
#install.packages("caTools")
library(caTools)

In [15]:
set.seed(123)
split <- sample.split(Y = dataset$Purchased,SplitRatio = 2/3)
training_set <-subset(dataset,split==T)
test_set <- subset(dataset,split==F)

In [17]:
View(test_set)
View(training_set)

  Country Age        Salary     Purchased
6 1       -0.5208015 -0.4996306 1
7 2        0.0000000 -1.0184777 0
8 1        1.2713683  1.3163344 1
9 3        1.5470867  1.6622325 0

   Country Age        Salary     Purchased
1  1        0.7199314  0.7110128 0
2  2       -1.6236751 -1.3643758 1
3  3       -1.2100975 -0.8455287 0
4  2       -0.1072238 -0.2402070 0
5  3        0.1684946  0.0000000 1
10 1       -0.2450830  0.2786401 1